In [10]:
import pandas as pd

In [11]:
a = pd.Series([1,2,3,4,5])

In [12]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
type(a)

pandas.core.series.Series

In [14]:
a = pd.date_range(start='01-01-2019',end='15-07-2019')

In [15]:
a

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10',
               ...
               '2019-07-06', '2019-07-07', '2019-07-08', '2019-07-09',
               '2019-07-10', '2019-07-11', '2019-07-12', '2019-07-13',
               '2019-07-14', '2019-07-15'],
              dtype='datetime64[ns]', length=196, freq='D')

In [16]:
import numpy as np

In [17]:
temp = np.random.randint(low=20, high=100,size[20,])

SyntaxError: positional argument follows keyword argument (<ipython-input-17-b355e9c31abc>, line 1)

In [18]:
temp = np.random.randint(low=20, high=100, size[20,])

SyntaxError: positional argument follows keyword argument (<ipython-input-18-96756d5f0099>, line 1)

In [19]:
temp = np.random.randint(low=20, high=100, size = [20,])

In [20]:
temp

array([37, 43, 67, 65, 58, 84, 51, 69, 20, 46, 79, 91, 34, 74, 95, 74, 83,
       67, 80, 92])

In [21]:
name = np.random.choice(['Kush','Hardik','Jigar','Manan'])

In [22]:
name

'Kush'

In [23]:
name = np.random.choice(['Kush','Hardik','Jigar','Manan'],20)

In [24]:
name

array(['Hardik', 'Kush', 'Jigar', 'Hardik', 'Hardik', 'Manan', 'Kush',
       'Jigar', 'Jigar', 'Jigar', 'Kush', 'Hardik', 'Jigar', 'Manan',
       'Hardik', 'Manan', 'Jigar', 'Manan', 'Manan', 'Jigar'], dtype='<U6')

In [25]:
random = np.random.choice([11,17,25,18],20)

In [26]:
random

array([18, 18, 18, 17, 25, 11, 11, 11, 18, 25, 25, 25, 17, 17, 18, 11, 11,
       25, 18, 25])

In [27]:
a = list(zip(temp,name,random))

In [28]:
a

[(37, 'Hardik', 18),
 (43, 'Kush', 18),
 (67, 'Jigar', 18),
 (65, 'Hardik', 17),
 (58, 'Hardik', 25),
 (84, 'Manan', 11),
 (51, 'Kush', 11),
 (69, 'Jigar', 11),
 (20, 'Jigar', 18),
 (46, 'Jigar', 25),
 (79, 'Kush', 25),
 (91, 'Hardik', 25),
 (34, 'Jigar', 17),
 (74, 'Manan', 17),
 (95, 'Hardik', 18),
 (74, 'Manan', 11),
 (83, 'Jigar', 11),
 (67, 'Manan', 25),
 (80, 'Manan', 18),
 (92, 'Jigar', 25)]

In [29]:
df = pd.DataFrame(data=a, columns=['temp','name','random'])

In [30]:
df

    temp    name  random
0     37  Hardik      18
1     43    Kush      18
2     67   Jigar      18
3     65  Hardik      17
4     58  Hardik      25
5     84   Manan      11
6     51    Kush      11
7     69   Jigar      11
8     20   Jigar      18
9     46   Jigar      25
10    79    Kush      25
11    91  Hardik      25
12    34   Jigar      17
13    74   Manan      17
14    95  Hardik      18
15    74   Manan      11
16    83   Jigar      11
17    67   Manan      25
18    80   Manan      18
19    92   Jigar      25

In [31]:
zip(temp,name,random)

In [32]:
df.head()

   temp    name  random
0    37  Hardik      18
1    43    Kush      18
2    67   Jigar      18
3    65  Hardik      17
4    58  Hardik      25

In [33]:
df.columns

Index(['temp', 'name', 'random'], dtype='object')

df.name

In [34]:
df.name

0     Hardik
1       Kush
2      Jigar
3     Hardik
4     Hardik
5      Manan
6       Kush
7      Jigar
8      Jigar
9      Jigar
10      Kush
11    Hardik
12     Jigar
13     Manan
14    Hardik
15     Manan
16     Jigar
17     Manan
18     Manan
19     Jigar
Name: name, dtype: object

In [35]:
df['name']

0     Hardik
1       Kush
2      Jigar
3     Hardik
4     Hardik
5      Manan
6       Kush
7      Jigar
8      Jigar
9      Jigar
10      Kush
11    Hardik
12     Jigar
13     Manan
14    Hardik
15     Manan
16     Jigar
17     Manan
18     Manan
19     Jigar
Name: name, dtype: object

In [36]:
df['name'].describe()

count        20
unique        4
top       Jigar
freq          7
Name: name, dtype: object

In [37]:
type(df.values)

numpy.ndarray

In [38]:
df.set_index('temp', inplace = True)

In [39]:
df

        name  random
temp
37    Hardik      18
43      Kush      18
67     Jigar      18
65    Hardik      17
58    Hardik      25
84     Manan      11
51      Kush      11
69     Jigar      11
20     Jigar      18
46     Jigar      25
79      Kush      25
91    Hardik      25
34     Jigar      17
74     Manan      17
95    Hardik      18
74     Manan      11
83     Jigar      11
67     Manan      25
80     Manan      18
92     Jigar      25

In [40]:
df.sort_index(axis =0, ascending=False)

        name  random
temp
95    Hardik      18
92     Jigar      25
91    Hardik      25
84     Manan      11
83     Jigar      11
80     Manan      18
79      Kush      25
74     Manan      17
74     Manan      11
69     Jigar      11
67     Manan      25
67     Jigar      18
65    Hardik      17
58    Hardik      25
51      Kush      11
46     Jigar      25
43      Kush      18
37    Hardik      18
34     Jigar      17
20     Jigar      18

In [41]:
df1 = pd.read_csv("weather_data.csv")

In [42]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [43]:
df1.to_excel

<bound method NDFrame.to_excel of         day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny>

In [44]:
df2 = pd.read_excel("df_xl.xlsx")

In [45]:
df2

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017           32          6   Rain
1           1  1/2/2017           35          7  Sunny
2           2  1/3/2017           28          2   Snow
3           3  1/4/2017           24          7   Snow
4           4  1/5/2017           32          4   Rain
5           5  1/6/2017           31          2  Sunny

In [46]:
# Merging & concat
d1 = pd.DataFrame([['a', 1], ['b', 2]],columns=['col1', 'number'])
d2 = pd.DataFrame([['c', 3, 'lion'], ['d', 4, 'tiger']],columns=['letter', 'number', 'animal'])

In [47]:
d1

  col1  number
0    a       1
1    b       2

In [48]:
d2

  letter  number animal
0      c       3   lion
1      d       4  tiger

In [49]:
pd.concat([d1,d2],axis=0)

/home/asite/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
0   lion  NaN      c       3
1  tiger  NaN      d       4

In [51]:
d1 = pd.DataFrame({
    "city":["Lucknow","Delhi","Ahmedabad","Kanpur"],
    "temperature":[29,30,21,25]
}
)

In [52]:
d1

        city  temperature
0    Lucknow           29
1      Delhi           30
2  Ahmedabad           21
3     Kanpur           25

In [53]:
d2 = pd.DataFrame({
    "city":["Kanpur","Lucknow","Delhi"],
    "humidity":[70,90,82]
}
)

In [54]:
d2

      city  humidity
0   Kanpur        70
1  Lucknow        90
2    Delhi        82

In [55]:
df=pd.merge(d1,d2,on="city")

In [56]:
df

      city  temperature  humidity
0  Lucknow           29        90
1    Delhi           30        82
2   Kanpur           25        70

In [57]:
df=pd.merge(d1,d2,on=['city'], how='outer')

In [58]:
df

        city  temperature  humidity
0    Lucknow           29      90.0
1      Delhi           30      82.0
2  Ahmedabad           21       NaN
3     Kanpur           25      70.0

In [59]:
# pip3 install xlrd
df2 = pd.read_excel('df_xl.xlsx')

In [60]:
df2

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017           32          6   Rain
1           1  1/2/2017           35          7  Sunny
2           2  1/3/2017           28          2   Snow
3           3  1/4/2017           24          7   Snow
4           4  1/5/2017           32          4   Rain
5           5  1/6/2017           31          2  Sunny

In [61]:
df2['hot_temp'] = df2['temperature'].apply(lambda x: x > 30)

In [62]:
df2

   Unnamed: 0       day  temperature  windspeed  event  hot_temp
0           0  1/1/2017           32          6   Rain      True
1           1  1/2/2017           35          7  Sunny      True
2           2  1/3/2017           28          2   Snow     False
3           3  1/4/2017           24          7   Snow     False
4           4  1/5/2017           32          4   Rain      True
5           5  1/6/2017           31          2  Sunny      True

In [63]:
df2.pivot_table(values = 'temperature', index = 'event', aggfunc = 'mean')

       temperature
event
Rain            32
Snow            26
Sunny           33